In [2]:
import pandas as pd

In [2]:
data =[1,2,3,4,5,6,7,8,9]
series = pd.Series(data)
print(series)

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
dtype: int64

In [3]:
data = { 'a':1, 'b':2, 'c':3, 'd':4, 'e':5 }
series_dict = pd.Series(data)
print(series_dict)

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [10]:
data = [10, 20, 30, 40, 50]
index = ['a', 'b', 'c', 'd', 'e']
pd.Series(data=data,index=index)

a    10
b    20
c    30
d    40
e    50
dtype: int64

In [18]:
data={
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [25, 30, 35],
    'City': ['New York', 'Los Angeles', 'Chicago']
}
index = ['a', 'b', 'c']
df = pd.DataFrame(data,index)
print(df)

      Name  Age         City
a    Alice   25     New York
b      Bob   30  Los Angeles
c  Charlie   35      Chicago

In [7]:
import pandas as pd
df = pd.read_csv('example.csv')
df.head(5)

,OrderID,OrderDate,CustomerID,Region,Product,Category,Quantity,UnitPrice,TotalSale,Shipped
0,101,2025-07-01,CUST-001,North,Laptop,Electronics,1,1200.0,1200.0,Yes
1,102,2025-07-01,CUST-002,South,Mouse,Accessories,2,25.5,51.0,Yes
2,103,2025-07-02,CUST-003,North,Keyboard,Accessories,1,75.0,75.0,No
3,104,2025-07-03,CUST-001,North,Monitor,Electronics,2,300.0,600.0,Yes
4,105,2025-07-04,CUST-004,West,Webcam,Accessories,1,50.0,50.0,Yes

In [13]:
data

{'Name': ['Alice', 'Bob', 'Charlie'],
 'Age': [25, 30, 35],
 'City': ['New York', 'Los Angeles', 'Chicago']}

In [20]:
df['Name']
df["Age"]

a    25
b    30
c    35
Name: Age, dtype: int64

In [23]:
df.iloc[0]

Name       Alice
Age           25
City    New York
Name: a, dtype: object

In [ ]:
df.at['b','Name']

'Bob'

In [31]:
df.iat[2,2]

'Chicago'

In [36]:
df['Salary'] = [50000,60000,70000]
df

      Name  Age         City  Salary
a    Alice   25     New York   50000
b      Bob   30  Los Angeles   60000
c  Charlie   35      Chicago   70000

In [41]:
df.drop('Salary', axis = 1,inplace =True)

In [42]:
df

      Name  Age         City
a    Alice   25     New York
b      Bob   30  Los Angeles
c  Charlie   35      Chicago

In [45]:
df["Age"]= df["Age"] + 5
df

      Name  Age         City
a    Alice   35     New York
b      Bob   40  Los Angeles
c  Charlie   45      Chicago

In [48]:
df.describe()

        Age
count   3.0
mean   40.0
std     5.0
min    35.0
25%    37.5
50%    40.0
75%    42.5
max    45.0